# OfCategory Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredElementCollector..::..OfCategory Method
FilteredElementCollector Class Example See Also
---
Applies an ElementCategoryFilter to the collector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FilteredElementCollector OfCategory(
	BuiltInCategory category
)
```

Visual Basic
---
```text
Public Function OfCategory ( _
	category As BuiltInCategory _
) As FilteredElementCollector
```

Visual C++
---
```text
public:
FilteredElementCollector^ OfCategory(
	BuiltInCategory category
)
```

# ### Parameters
category
    Type: Autodesk.Revit.DB..::..BuiltInCategory The category.
# ### Return Value
This collector.
# Remarks
Only elements of this category id will pass the collector.
# Examples
CopyC#
```text
// Use OfCategory method to apply an ElementCategoryFilter and fine elements in the Doors category
FilteredElementCollector collector = new FilteredElementCollector(document);
ICollection<Element> doors = collector.OfCategory(BuiltInCategory.OST_Doors).ToElements();
```

CopyVB.NET
```text
' Use OfCategory method to apply an ElementCategoryFilter and fine elements in the Doors category
Dim collector As New FilteredElementCollector(document)
Dim doors As ICollection(Of Element) = collector.OfCategory(BuiltInCategory.OST_Doors).ToElements()
```

# See Also
FilteredElementCollector Class
Autodesk.Revit.DB Namespace